#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//整数的二进制表示有3种:
//源码，反码，补码
//正数的三种码相同
//负数的需要计算
//最高位0代表正数，1代表负数
//7，整形占四个字节，一个字节八个比特位
//00000000000000000000000000000111 源码
//00000000000000000000000000000111 反码
//00000000000000000000000000000111 补码
//-7
//10000000000000000000000000000111 源码
//11111111111111111111111111111000(符号位不变，其他位取反)反码
//11111111111111111111111111111001(反码+1就是补码)
//整数在内存中存储的是补码

//int main()
//{
//	int a = 7;
//	int b = a << 1;
//	printf("a=%d\n", a);//7
//	printf("b=%d\n", b);//14
//	return 0;
//}

//&按位与,只有两个补码对应的数字都为1才是1，有一个0就算0
//按位或，只有对应数字都为0才是0，有一个1就算1
//按位异或,相同为0，相异为1
//只适用于整形
//int main()
//{
//	int a = 3;    //00000000000000000000000000000011 3的补码
//	int b = -5;   //11111111111111111111111111111011 -5的补码
//	int c = a & b;//00000000000000000000000000000011 c的补码
//	printf("c=%d", c);
//	return 0;
//}

//int main()
//{
//	int a = 3;        //00000000000000000000000000000011 3的补码
//	int b = -5;       //11111111111111111111111111111011 -5的补码
//	int c = a | b;    //11111111111111111111111111111011 c的补码
//	printf("c=%d", c);//11111111111111111111111111111010 c的反码
//	return 0;         //10000000000000000000000000000101 c的源码
//}

//int main()
//{
//	int a = 3;        //00000000000000000000000000000011 3的补码
//	int b = -5;       //11111111111111111111111111111011 -5的补码
//	int c = a ^ b;    //11111111111111111111111111111000 c的补码
//	printf("c=%d", c);//11111111111111111111111111110111 c的反码
//	return 0;         //10000000000000000000000000001000 c的源码
//}

//练习:
//不创建临时变量将两个数值交换
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("a=%d b=%d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}
//这种方法有可能会溢出,但速度快

//异或规律:
//a^a = 0
//0^a = a
//异或支持交换律
//优化:

//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("a=%d b=%d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}

int main()
{
	int a = 3;
	int n = 0;
	int count = 0;
	for (n = 1; n <= 32; n++)
	{
		if (a & 1 == 1)
		{
			count++;
		}
		else
		{
			continue;
		}
		a >> 1;
	}
	printf("%d\n", count);
	return 0;
}











